grpc-vs-rest-hl7-load-balancer-benchmark/load-tests/testing-results/150-RPS/gRPC.txt
========================================================================================================================
---- Global Information -------------------------------------------------------------|---Total---|-----OK----|----KO----
> request count                                                                      |    11,550 |     6,182 |     5,368
> min response time (ms)                                                             |        15 |        15 |    60,000
> max response time (ms)                                                             |    60,097 |    59,980 |    60,097
> mean response time (ms)                                                            |    39,147 |    21,039 |    60,001
> response time std deviation (ms)                                                   |    24,418 |    20,209 |         3
> response time 50th percentile (ms)                                                 |    55,597 |    15,509 |    60,000
> response time 75th percentile (ms)                                                 |    60,000 |    38,335 |    60,001
> response time 95th percentile (ms)                                                 |    60,001 |    56,615 |    60,002
> response time 99th percentile (ms)                                                 |    60,008 |    59,332 |    60,013
> mean throughput (rps)                                                              |        70 |     37.47 |     32.53
---- Response Time Distribution ----------------------------------------------------------------------------------------
> OK: t < 800 ms                                                                                          1,588 (13.75%)
> OK: 800 ms <= t < 1200 ms                                                                                  75  (0.65%)
> OK: t >= 1200 ms                                                                                        4,519 (39.13%)
> KO                                                                                                      5,368 (46.48%)
---- Errors ------------------------------------------------------------------------------------------------------------
> Request timeout to localhost/127.0.0.1:8080 after 60000 ms                                              5,368   (100%)
========================================================================================================================